<?php

// +----------------------------------------------------------------------
// | 破晓科技 [ 科技以人为本 ]
// +----------------------------------------------------------------------
// | Copyright (c) 2014 http://www.ipoxiao.com All rights reserved.
// +----------------------------------------------------------------------
// | Author: Everyday <fenghao@ipoxiao.com> <http://www.ipoxiao.com>
// +----------------------------------------------------------------------

namespace Common\Library\EPay;

/**
 * 返回信息配置类
 */
class Message {

    /**
     * 注册接口
     * @var type 
     */
    private $_registerbind = array(
        '88' => "成功",
        '01' => "开户类型错误",
        '02' => "手机号错误",
        '03' => "邮箱错误",
        '04' => '真实姓名或企业名称错误',
        '05' => "身份证号或营业执照号错误",
        '06' => "身份证或营业执照图片错误",
        '07' => "平台乾多多标识错误",
        '08' => '签名验证失败',
        '09' => '手机和邮箱已存在',
        '10' => '邮箱已存在',
        '11' => '手机号已存在',
        '12' => '登录密码错误',
        '13' => '支付密码错误',
        '14' => '安保问题错误',
        '15' => '用户网贷平台账号错误',
        '16' => '网贷平台账号已绑定',
        '17' => '随机时间戳错误',
        '18' => '自定义备注错误',
        '19' => '乾多多账号被禁用',
        '20' => '乾多多账号未激活',
        '22' => '手机或邮箱验证码输入错误',
        '23' => '提交的身份信息与乾多多的信息不符',
        '24' => '绑定的乾多多账号为平台账号',
        '25' => '乾多多账号已绑定别的平台',
        '26' => '密码、手机或邮箱验证码、安保问题错误次数过多，锁定中',
        '27' => '账户类型错误',
        '28' => '网贷平台账号已绑定，相同网贷平台账号提交过至少两次不同身份信息',
        '29' => '乾多多账号已被平台其他用户绑定',
        '30' => '平台自有账户余额不足',
        '31' => '身份信息认证失败'
    );
    private $_fastpay = array(
        '88' => '成功',
        '89' => '汇款绑卡已申请',
        '01' => '用户乾多多标识错误',
        '02' => '操作类型错误',
        '03' => '平台乾多多标识错误',
        '04' => '签名验证失败',
        '05' => '代扣日期错误',
        '06' => '单笔代扣限额错误',
        '07' => '代扣总限额错误',
        '08' => '随机时间戳错误',
        '09' => '自定义备注错误',
        '10' => '账号已实名认证',
        '11' => '银行卡号错误',
        '12' => '用户身份证信息错误',
        '13' => '登录密码输入错误',
        '14' => '短信验证码输入错误',
        '15' => '安保问题输入错误',
        '16' => '密码、验证码或安保问题错误次数过多，锁定中',
        '17' => '快捷支付失败',
        '18' => '银行卡已存在',
        '19' => '银行卡未授权代扣或正在审核中',
        '20' => '汇款绑卡确认的银行卡错误',
        '21' => '汇款绑卡金额错误',
    );

    /**
     * 审核
     * @var type 
     */
    private $_feraudit = array(
        '88' => '成功',
        '01' => '乾多多流水号列表错误',
        '02' => '审核类型错误',
        '03' => '平台乾多多标识错误',
        '05' => '签名验证失败',
        '07' => '随机时间戳错误',
        '08' => '自定义备注错误',
        '09' => '操作人不唯一',
        '10' => '余额不足',
        '12' => '支付密码输入错误',
        '13' => '短信验证码输入错误',
        '14' => '安保问题输入错误',
        '15' => '密码、验证码或安保问题错误次数过多，锁定中',
    );

    /**
     * 获取变量对应的值
     */
    public function getVal($name, $k) {
        $name = "_" . strtolower($name);
        $result = $this->$name;
        return $result[$k];
    }

}
